Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/tec.c
        assert(param->selectedExternalFault  == TEC_EXTERNAL_FAULT_0 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_1 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_2 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_3 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_4 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_5 ||
               param->selectedExternalFault  == TEC_EXTERNAL_FAULT_6
               );

        assert(param->signalType  == TEC_EXTERNAL_FAULT_SIGNALTYPE_EDGE_SENSITIVE ||
               param->signalType  == TEC_EXTERNAL_FAULT_SIGNALTYPE_LEVEL_SENSITIVE
               );

        assert(param->signalHold  == TEC_EXTERNAL_FAULT_SIGNAL_NOT_HELD ||
               param->signalHold  == TEC_EXTERNAL_FAULT_SIGNAL_HELD
               );

        assert(param->polarityBit == TEC_EXTERNAL_FAULT_POLARITY_FALLING_EDGE_OR_LOW_LEVEL ||
               param->polarityBit == TEC_EXTERNAL_FAULT_POLARITY_RISING_EDGE_OR_HIGH_LEVEL
               );

        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  &= ~((TEC_EXTERNAL_FAULT_SIGNALTYPE_LEVEL_SENSITIVE << param->selectedExternalFault) +
                                                    (TEC_EXTERNAL_FAULT_POLARITY_RISING_EDGE_OR_HIGH_LEVEL << param->selectedExternalFault) +
                                                    (TEC_EXTERNAL_FAULT_SIGNAL_HELD << param->selectedExternalFault )
                                                    );

        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  |= ((param->signalType << param->selectedExternalFault) +
                                                   (param->polarityBit << param->selectedExternalFault) +
                                                   (param->signalHold << param->selectedExternalFault )
                                                   );
}
//*****************************************************************************
//
//! \brief Enable the Timer Event Control External fault input
//!
//! \param baseAddress is the base address of the TEC module.
//! \param channelEventBlock selects the channel event block
//!        Valid values are:
//!        - \b TEC_CE0
//!        - \b TEC_CE1
//!        - \b TEC_CE2
//!        - \b TEC_CE3 - (available on TEC5 TEC7)
//!        - \b TEC_CE4 - (available on TEC5 TEC7)
//!        - \b TEC_CE5 - (only available on TEC7)
//!        - \b TEC_CE6 - (only available on TEC7)
//!
//! Modified bits of \b TECxCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_enableExternalFaultInput(uint16_t baseAddress,
                                  uint8_t channelEventBlock
                                  )
{

        assert( channelEventBlock  == TEC_CE0 ||
                channelEventBlock  == TEC_CE1 ||
                channelEventBlock  == TEC_CE2 ||
                channelEventBlock  == TEC_CE3 ||
                channelEventBlock  == TEC_CE4 ||
                channelEventBlock  == TEC_CE5 ||
                channelEventBlock  == TEC_CE6
                );

        HWREG8(baseAddress + OFS_TEC0XCTL0_H)  |= (1 << channelEventBlock );
}

//*****************************************************************************
//
//! \brief Disable the Timer Event Control External fault input
//!
//! \param baseAddress is the base address of the TEC module.
//! \param channelEventBlock selects the channel event block
//!        Valid values are:
//!        - \b TEC_CE0
//!        - \b TEC_CE1
//!        - \b TEC_CE2
//!        - \b TEC_CE3 - (available on TEC5 TEC7)
//!        - \b TEC_CE4 - (available on TEC5 TEC7)
//!        - \b TEC_CE5 - (only available on TEC7)
//!        - \b TEC_CE6 - (only available on TEC7)
//!
//! Modified bits of \b TECxCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_disableExternalFaultInput(uint16_t baseAddress,
                                   uint8_t channelEventBlock
                                   )
{

        assert( channelEventBlock  == TEC_CE0 ||
                channelEventBlock  == TEC_CE1 ||
                channelEventBlock  == TEC_CE2 ||
                channelEventBlock  == TEC_CE3 ||
                channelEventBlock  == TEC_CE4 ||
                channelEventBlock  == TEC_CE5 ||
                channelEventBlock  == TEC_CE6
                );

        HWREG8(baseAddress + OFS_TEC0XCTL0_H)  &= ~(1 << channelEventBlock );
}

//*****************************************************************************
//
//! \brief Enable the Timer Event Control External Clear Input
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! Modified bits of \b TECxCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_enableExternalClearInput(uint16_t baseAddress )
{
        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  |= TECEXCLREN;
}

//*****************************************************************************
//
//! \brief Disable the Timer Event Control External Clear Input
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! Modified bits of \b TECxCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_disableExternalClearInput(uint16_t baseAddress )
{
        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  &= ~TECEXCLREN;
}

//*****************************************************************************
//
//! \brief Enable the Timer Event Control Auxiliary Clear Signal
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! Modified bits of \b TECxCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_enableAuxiliaryClearSignal(uint16_t baseAddress )
{
        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  |= TECAXCLREN;
}

//*****************************************************************************
//
//! \brief Disable the Timer Event Control Auxiliary Clear Signal
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! Modified bits of \b TECxCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void TEC_disableAuxiliaryClearSignal(uint16_t baseAddress )
{
        HWREG8(baseAddress + OFS_TEC0XCTL2_L)  &= ~TECAXCLREN;
}

//*****************************************************************************
//
//! \brief Clears the Timer Event Control Interrupt flag
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the masked interrupt flag to be cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_EXTERNAL_FAULT_INTERRUPT - External fault interrupt flag
//!        - \b TEC_EXTERNAL_CLEAR_INTERRUPT - External clear interrupt flag
//!        - \b TEC_AUXILIARY_CLEAR_INTERRUPT - Auxiliary clear interrupt flag
//!
//! Modified bits of \b TECxINT register.
//!
//! \return None
//
//*****************************************************************************
void TEC_clearInterruptFlag(uint16_t baseAddress,
                            uint8_t mask
                            )
{
        assert( 0x00 == ( mask & ~(TEC_EXTERNAL_FAULT_INTERRUPT +
                                   TEC_EXTERNAL_CLEAR_INTERRUPT +
                                   TEC_AUXILIARY_CLEAR_INTERRUPT
                                   ))
                );

