Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/tec.c
        HWREG8(baseAddress + OFS_TEC0XINT_L)  &= ~mask;
}

//*****************************************************************************
//
//! \brief Gets the current Timer Event Control interrupt status.
//!
//! This returns the interrupt status for the module based on which flag is
//! passed.
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_EXTERNAL_FAULT_INTERRUPT - External fault interrupt flag
//!        - \b TEC_EXTERNAL_CLEAR_INTERRUPT - External clear interrupt flag
//!        - \b TEC_AUXILIARY_CLEAR_INTERRUPT - Auxiliary clear interrupt flag
//!
//! \return Logical OR of any of the following:
//!         - \b TEC_EXTERNAL_FAULT_INTERRUPT External fault interrupt flag
//!         - \b TEC_EXTERNAL_CLEAR_INTERRUPT External clear interrupt flag
//!         - \b TEC_AUXILIARY_CLEAR_INTERRUPT Auxiliary clear interrupt flag
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
uint8_t TEC_getInterruptStatus(uint16_t baseAddress,
                               uint8_t mask
                               )
{
        assert( 0x00 == ( mask & ~(TEC_EXTERNAL_FAULT_INTERRUPT +
                                   TEC_EXTERNAL_CLEAR_INTERRUPT +
                                   TEC_AUXILIARY_CLEAR_INTERRUPT
                                   ))
                );
        //Return the interrupt status of the request masked bit.
        return HWREG8(baseAddress + OFS_TEC0XINT_L) & mask;
}

//*****************************************************************************
//
//! \brief Enables individual Timer Event Control interrupt sources.
//!
//! Enables the indicated Timer Event Control interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor. Does not clear interrupt
//! flags.
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_EXTERNAL_FAULT_INTERRUPT - External fault interrupt flag
//!        - \b TEC_EXTERNAL_CLEAR_INTERRUPT - External clear interrupt flag
//!        - \b TEC_AUXILIARY_CLEAR_INTERRUPT - Auxiliary clear interrupt flag
//!
//! Modified bits of \b TECxINT register.
//!
//! \return None
//
//*****************************************************************************
void TEC_enableInterrupt(uint16_t baseAddress,
                         uint8_t mask
                         )
{
        assert( 0x00 == ( mask & ~(TEC_EXTERNAL_FAULT_INTERRUPT +
                                   TEC_EXTERNAL_CLEAR_INTERRUPT +
                                   TEC_AUXILIARY_CLEAR_INTERRUPT
                                   ))
                );

        //Enable the interrupt masked bit
        HWREG8(baseAddress + OFS_TEC0XINT_H) |= mask;
}

//*****************************************************************************
//
//! \brief Disables individual Timer Event Control interrupt sources.
//!
//! Disables the indicated Timer Event Control interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor.
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the bit mask of the interrupt sources to be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_EXTERNAL_FAULT_INTERRUPT - External fault interrupt flag
//!        - \b TEC_EXTERNAL_CLEAR_INTERRUPT - External clear interrupt flag
//!        - \b TEC_AUXILIARY_CLEAR_INTERRUPT - Auxiliary clear interrupt flag
//!
//! Modified bits of \b TECxINT register.
//!
//! \return None
//
//*****************************************************************************
void TEC_disableInterrupt(uint16_t baseAddress,
                          uint8_t mask
                          )
{
        assert( 0x00 == ( mask & ~(TEC_EXTERNAL_FAULT_INTERRUPT +
                                   TEC_EXTERNAL_CLEAR_INTERRUPT +
                                   TEC_AUXILIARY_CLEAR_INTERRUPT
                                   ))
                );

        //Disable the interrupt masked bit
        HWREG8(baseAddress + OFS_TEC0XINT_H) &= ~(mask);
}

//*****************************************************************************
//
//! \brief Gets the current Timer Event Control External Fault Status
//!
//! This returns the Timer Event Control fault status for the module.
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_CE0
//!        - \b TEC_CE1
//!        - \b TEC_CE2
//!        - \b TEC_CE3 - (available on TEC5 TEC7)
//!        - \b TEC_CE4 - (available on TEC5 TEC7)
//!        - \b TEC_CE5 - (only available on TEC7)
//!        - \b TEC_CE6 - (only available on TEC7)
//!
//! \return Logical OR of any of the following:
//!         - \b TEC_CE0
//!         - \b TEC_CE1
//!         - \b TEC_CE2
//!         - \b TEC_CE3 (available on TEC5 TEC7)
//!         - \b TEC_CE4 (available on TEC5 TEC7)
//!         - \b TEC_CE5 (only available on TEC7)
//!         - \b TEC_CE6 (only available on TEC7)
//!         \n indicating the external fault status of the masked channel event
//!         blocks
//
//*****************************************************************************
uint8_t TEC_getExternalFaultStatus(uint16_t baseAddress,
                                   uint8_t mask
                                   )
{
        assert( 0x00 == ( mask & ~(TEC_CE0 +
                                   TEC_CE1 +
                                   TEC_CE2 +
                                   TEC_CE3 +
                                   TEC_CE4 +
                                   TEC_CE5 +
                                   TEC_CE6
                                   ))
                );
        //Return the interrupt status of the request masked bit.
        return HWREG8(baseAddress + OFS_TEC0STA_L) & mask;
}

//*****************************************************************************
//
//! \brief Clears the Timer Event Control External Fault Status
//!
//! \param baseAddress is the base address of the TEC module.
//! \param mask is the masked status flag be cleared
//!        Mask value is the logical OR of any of the following:
//!        - \b TEC_CE0
//!        - \b TEC_CE1
//!        - \b TEC_CE2
//!        - \b TEC_CE3 - (available on TEC5 TEC7)
//!        - \b TEC_CE4 - (available on TEC5 TEC7)
//!        - \b TEC_CE5 - (only available on TEC7)
//!        - \b TEC_CE6 - (only available on TEC7)
//!
//! Modified bits of \b TECxINT register.
//!
//! \return None
//
//*****************************************************************************
void TEC_clearExternalFaultStatus(uint16_t baseAddress,
                                  uint8_t mask
                                  )
{
        assert( 0x00 == ( mask & ~(TEC_CE0 +
                                   TEC_CE1 +
                                   TEC_CE2 +
                                   TEC_CE3 +
                                   TEC_CE4 +
                                   TEC_CE5 +
                                   TEC_CE6
                                   ))
                );

        HWREG8(baseAddress + OFS_TEC0STA_L)  &= ~mask;
}

//*****************************************************************************
//
//! \brief Gets the current Timer Event Control External Clear Status
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! \return One of the following:
//!         - \b TEC_EXTERNAL_CLEAR_DETECTED
//!         - \b TEC_EXTERNAL_CLEAR_NOT_DETECTED
//!         \n indicating the status of the external clear
//
//*****************************************************************************
uint8_t TEC_getExternalClearStatus(uint16_t baseAddress)

{
        //Return the interrupt status of the request masked bit.
        return HWREG8(baseAddress + OFS_TEC0STA_L) & TECXCLRSTA;
}

//*****************************************************************************
//
//! \brief Clears the Timer Event Control External Clear Status
//!
//! \param baseAddress is the base address of the TEC module.
//!
//! Modified bits of \b TECxINT register.
//!
//! \return None
//
//*****************************************************************************
void TEC_clearExternalClearStatus(uint16_t baseAddress)
{
        HWREG8(baseAddress + OFS_TEC0STA_L)  &= ~TECXCLRSTA;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for tec_api
//! @}
//
//*****************************************************************************
